In [11]:
import pandas as pd
import numpy as np

In [12]:
df = pd.DataFrame(columns = ['A', 'B', 'C'])

In [13]:
df

Empty DataFrame
Columns: [A, B, C]
Index: []

In [14]:
df.loc[0, 'A'] = 1

In [15]:
df

   A    B    C
0  1  NaN  NaN

In [16]:
df.loc[1] = [2, 3, 4]

In [17]:
df

   A    B    C
0  1  NaN  NaN
1  2    3    4

In [18]:
df.loc[2] = {'A': 3, 'C': 9, 'B': 9}

In [19]:
df

   A    B    C
0  1  NaN  NaN
1  2    3    4
2  3    9    9